nxp-mcuxpresso/mcux-soc-svd/MCXN547T/MCXN547T_cm33_core0.xml
        <register>
          <name>CMDL7</name>
          <description>Command Low Buffer Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_CH0</name>
                  <description>CH0A or CH0B or CH0A/CH0B pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH1</name>
                  <description>CH1A or CH1B or CH1A/CH1B pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH2</name>
                  <description>CH2A or CH2B or CH2A/CH2B pair.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH3</name>
                  <description>CH3A or CH3B or CH3A/CH3B pair.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_4</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_5</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_6</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_7</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_8</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_9</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_10</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_11</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_12</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_13</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_24</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_25</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_26</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_27</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_28</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHANNEL_29</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH30</name>
                  <description>CH30A or CH30B or CH30A/CH30B pair.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH31</name>
                  <description>CH31A or CH31B or CH31A/CH31B pair.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Conversion Type</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ENDED_A_SIDE_CHANNEL</name>
                  <description>Single-Ended mode. Only A-side channel is converted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ENDED_B_SIDE_CHANNEL</name>
                  <description>Single-Ended mode. Only B-side channel is converted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFFERENTIAL_A_MINUS_B</name>
                  <description>Differential mode. A-B.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_A_AND_B</name>
                  <description>Dual-Single-Ended mode. Both A-side and B-side channels are converted independently.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Select Resolution of Conversions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_12_BITS</name>
                  <description>Standard resolution. Single-ended 12-bit conversion; differential 13-bit conversion with 2's complement output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_16_BITS</name>
                  <description>High resolution. Single-ended 16-bit conversion; differential 16-bit conversion with 2's complement output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTB_ADCH</name>
              <description>Alternate Channel B Input Channel Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_CH0B</name>
                  <description>Select CH0B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH1B</name>
                  <description>Select CH1B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH2B</name>
                  <description>Select CH2B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH3B</name>
                  <description>Select CH3B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_4</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_5</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_6</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_7</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_8</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_9</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_10</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_11</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_12</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_13</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_24</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_25</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_26</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_27</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_28</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CORRESPONDING_CHnB_29</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH30B</name>
                  <description>Select CH30B</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_CH31B</name>
                  <description>Select CH31B</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTBEN</name>
              <description>Alternate Channel B Select Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ALTBEN_ADCH disabled. Channel-A and Channel-B inputs are selected based on ADCH settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>ALTBEN_ADCH enabled. Channel-A inputs are selected by ADCH setting and Channel-B inputs are selected by ALTB_ADCH setting.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
